app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "PPD"], ["room_number", 405], ["created_at", "2020-08-13 17:05:02.379261"], ["updated_at", "2020-08-13 17:05:02.379261"]]
---
    def create
        @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
        @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @school_class = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @school_class = SchoolClass.find_by_id(params[:id])

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Matematika"], ["room_number", 204], ["updated_at", "2020-08-13 17:19:45.240492"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.update(params.require(:school_class).permit(:title, :room_number))